Ran Plan for project: `atlantis-prod` dir: `terraform/environments/prod/atlantis` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.atlantis will be updated in-place
~ resource "aws_ecs_service" "atlantis" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/atlantis-prod/atlantis-prod"
        name                               = "atlantis-prod"
        tags                               = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "ECS service for Atlantis Terraform automation server"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "atlantis-prod"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
            "Team"        = "platform-team"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/atlantis-prod:11" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.atlantis must be replaced
-/+ resource "aws_ecs_task_definition" "atlantis" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/atlantis-prod:11" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/atlantis-prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "ATLANTIS_ATLANTIS_URL"
                          - value = "https://atlantis.set-of.com"
                        },
                      - {
                          - name  = "ATLANTIS_LOG_LEVEL"
                          - value = "debug"
                        },
                      - {
                          - name  = "ATLANTIS_PORT"
                          - value = "4141"
                        },
                      - {
                          - name  = "ATLANTIS_REPO_ALLOWLIST"
                          - value = "github.com/ryu-qqq/*"
                        },
                      - {
                          - name  = "ATLANTIS_REPO_CONFIG"
                          - value = "/home/atlantis/repos.yaml"
                        },
                      - {
                          - name  = "ATLANTIS_WRITE_GIT_CREDS"
                          - value = "true"
                        },
                    ]
                  - essential        = true
                  - healthCheck      = {
                      - command     = [
                          - "CMD-SHELL",
                          - "curl -f http://localhost:4141/healthz || exit 1",
                        ]
                      - interval    = 30
                      - retries     = 3
                      - startPeriod = 60
                      - timeout     = 5
                    }
                  - image            = "646886795421.dkr.ecr.ap-northeast-2.amazonaws.com/atlantis:v0.30.0"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/atlantis-prod/application"
                          - awslogs-region        = "ap-northeast-2"
                          - awslogs-stream-prefix = "atlantis"
                        }
                    }
                  - mountPoints      = [
                      - {
                          - containerPath = "/home/atlantis/.atlantis"
                          - readOnly      = false
                          - sourceVolume  = "atlantis-data"
                        },
                    ]
                  - name             = "atlantis"
                  - portMappings     = [
                      - {
                          - containerPort = 4141
                          - hostPort      = 4141
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "ATLANTIS_GH_APP_ID"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt:app_id::"
                        },
                      - {
                          - name      = "ATLANTIS_GH_APP_INSTALLATION_ID"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt:installation_id::"
                        },
                      - {
                          - name      = "ATLANTIS_GH_APP_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt:private_key::"
                        },
                      - {
                          - name      = "ATLANTIS_GH_WEBHOOK_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7:webhook_secret::"
                        },
                    ]
                  - systemControls   = []
                  - ulimits          = [
                      - {
                          - hardLimit = 65536
                          - name      = "nofile"
                          - softLimit = 65536
                        },
                    ]
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "atlantis-prod" -> (known after apply)
      ~ revision                 = 11 -> (known after apply)
        tags                     = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "ECS task definition for Atlantis Terraform automation server"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "atlantis-prod"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
            "Team"        = "platform-team"
        }
        # (12 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "atlantis-data" -> null
            # (1 unchanged attribute hidden)

          - efs_volume_configuration {
              - file_system_id          = "fs-0404558fae26deb97" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "ENABLED" -> null
              - transit_encryption_port = 2049 -> null

              - authorization_config {
                  - access_point_id = "fsap-015fe847f3b144192" -> null
                  - iam             = "ENABLED" -> null
                }
            }
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "atlantis-data"
            # (1 unchanged attribute hidden)

          + efs_volume_configuration {
              + file_system_id          = "fs-0404558fae26deb97"
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 2049

              + authorization_config {
                  + access_point_id = "fsap-015fe847f3b144192"
                  + iam             = "ENABLED"
                }
            }
        }
    }

  # aws_iam_role_policy.atlantis-terraform-operations will be updated in-place
~ resource "aws_iam_role_policy" "atlantis-terraform-operations" {
        id          = "atlantis-ecs-task-prod:terraform-operations"
        name        = "terraform-operations"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    # (8 unchanged elements hidden)
                    {
                        Action   = [
                            "elasticloadbalancing:DescribeTargetGroups",
                            "elasticloadbalancing:ModifyTargetGroup",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = "ManageTargetGroups"
                    },
                  ~ {
                      ~ Action   = [
                          - "s3:Get*",
                          - "s3:Put*",
                          - "s3:Delete*",
                          + "s3:GetBucketPolicy",
                          + "s3:PutBucketPolicy",
                          + "s3:DeleteBucketPolicy",
                          + "s3:GetBucketAcl",
                          + "s3:PutBucketAcl",
                          + "s3:GetBucketCORS",
                          + "s3:PutBucketCORS",
                          + "s3:GetBucketVersioning",
                          + "s3:PutBucketVersioning",
                          + "s3:GetBucketLogging",
                          + "s3:PutBucketLogging",
                          + "s3:GetEncryptionConfiguration",
                          + "s3:PutEncryptionConfiguration",
                          + "s3:GetBucketPublicAccessBlock",
                          + "s3:PutBucketPublicAccessBlock",
                          + "s3:GetLifecycleConfiguration",
                          + "s3:PutLifecycleConfiguration",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Action   = [
                            # (5 unchanged elements hidden)
                            "elasticache:ModifyReplicationGroup",
                          - "elasticache:CreateCacheCluster",
                          - "elasticache:DeleteCacheCluster",
                          - "elasticache:ModifyCacheCluster",
                            "elasticache:AddTagsToResource",
                            # (5 unchanged elements hidden)
                        ]
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Action   = [
                          - "ssm:PutParameter",
                          - "ssm:DeleteParameter",
                          - "ssm:AddTagsToResource",
                          - "ssm:RemoveTagsFromResource",
                          + "sqs:CreateQueue",
                          + "sqs:DeleteQueue",
                          + "sqs:SetQueueAttributes",
                          + "sqs:TagQueue",
                          + "sqs:UntagQueue",
                        ]
                      ~ Resource = "arn:aws:ssm:ap-northeast-2:646886795421:parameter/fileflow/*" -> "arn:aws:sqs:ap-northeast-2:646886795421:*"
                      ~ Sid      = "ManageFileFlowSSMParameters" -> "ManageSQS"
                        # (1 unchanged attribute hidden)
                    },
                  ~ {
                      ~ Action   = [
                          ~ "sqs:CreateQueue" -> "cloudwatch:PutMetricAlarm",
                          ~ "sqs:DeleteQueue" -> "cloudwatch:DeleteAlarms",
                          ~ "sqs:SetQueueAttributes" -> "cloudwatch:DescribeAlarms",
                          ~ "sqs:TagQueue" -> "cloudwatch:TagResource",
                          ~ "sqs:UntagQueue" -> "cloudwatch:UntagResource",
                        ]
                      ~ Resource = "arn:aws:sqs:ap-northeast-2:646886795421:*" -> "arn:aws:cloudwatch:ap-northeast-2:646886795421:alarm:*"
                      ~ Sid      = "ManageSQS" -> "ManageCloudWatchAlarms"
                        # (1 unchanged attribute hidden)
                    },
                  ~ {
                      ~ Action   = [
                          - "cloudwatch:PutMetricAlarm",
                          - "cloudwatch:DeleteAlarms",
                          - "cloudwatch:DescribeAlarms",
                          - "cloudwatch:ListTagsForResource",
                          - "cloudwatch:TagResource",
                          - "cloudwatch:UntagResource",
                          + "ecs:CreateCluster",
                          + "ecs:DeleteCluster",
                          + "ecs:UpdateCluster",
                          + "ecs:RegisterTaskDefinition",
                          + "ecs:DeregisterTaskDefinition",
                          + "ecs:CreateService",
                          + "ecs:UpdateService",
                          + "ecs:DeleteService",
                          + "ecs:TagResource",
                          + "ecs:UntagResource",
                        ]
                      ~ Resource = "arn:aws:cloudwatch:ap-northeast-2:646886795421:alarm:*" -> "*"
                      ~ Sid      = "ManageCloudWatchAlarms" -> "ManageECS"
                        # (1 unchanged attribute hidden)
                    },
                  ~ {
                      ~ Action   = [
                          - "ecs:CreateCluster",
                          - "ecs:DeleteCluster",
                          - "ecs:UpdateCluster",
                          - "ecs:RegisterTaskDefinition",
                          - "ecs:DeregisterTaskDefinition",
                          - "ecs:CreateService",
                          - "ecs:UpdateService",
                          - "ecs:DeleteService",
                          - "ecs:ListTagsForResource",
                          - "ecs:TagResource",
                          - "ecs:UntagResource",
                          + "iam:CreateRole",
                          + "iam:DeleteRole",
                          + "iam:AttachRolePolicy",
                          + "iam:DetachRolePolicy",
                          + "iam:PutRolePolicy",
                          + "iam:DeleteRolePolicy",
                          + "iam:PassRole",
                          + "iam:TagRole",
                          + "iam:UntagRole",
                        ]
                      ~ Resource = "*" -> [
                          + "arn:aws:iam::646886795421:role/fileflow-*",
                          + "arn:aws:iam::646886795421:role/atlantis-*",
                        ]
                      ~ Sid      = "ManageECS" -> "ManageIAMRoles"
                        # (1 unchanged attribute hidden)
                    },
                  ~ {
                      ~ Action   = [
                          - "iam:CreateRole",
                          - "iam:DeleteRole",
                          - "iam:AttachRolePolicy",
                          - "iam:DetachRolePolicy",
                          - "iam:PutRolePolicy",
                          - "iam:DeleteRolePolicy",
                          - "iam:PassRole",
                          - "iam:TagRole",
                          - "iam:UntagRole",
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                          + "elasticloadbalancing:DeleteTargetGroup",
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      ~ Resource = [
                          - "arn:aws:iam::646886795421:role/fileflow-*",
                          - "arn:aws:iam::646886795421:role/atlantis-*",
                        ] -> "*"
                      ~ Sid      = "ManageIAMRoles" -> "ManageLoadBalancers"
                        # (1 unchanged attribute hidden)
                    },
                  ~ {
                      ~ Action   = [
                          - "elasticloadbalancing:CreateLoadBalancer",
                          - "elasticloadbalancing:DeleteLoadBalancer",
                          - "elasticloadbalancing:CreateTargetGroup",
                          - "elasticloadbalancing:DeleteTargetGroup",
                          - "elasticloadbalancing:CreateListener",
                          - "elasticloadbalancing:DeleteListener",
                          - "elasticloadbalancing:ModifyListener",
                          - "elasticloadbalancing:ModifyTargetGroupAttributes",
                          - "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          - "elasticloadbalancing:AddTags",
                          - "elasticloadbalancing:RemoveTags",
                          + "ecr:CreateRepository",
                          + "ecr:DeleteRepository",
                          + "ecr:PutLifecyclePolicy",
                          + "ecr:DeleteLifecyclePolicy",
                          + "ecr:SetRepositoryPolicy",
                          + "ecr:DeleteRepositoryPolicy",
                          + "ecr:TagResource",
                          + "ecr:UntagResource",
                        ]
                      ~ Resource = "*" -> "arn:aws:ecr:ap-northeast-2:646886795421:repository/*"
                      ~ Sid      = "ManageLoadBalancers" -> "ManageECR"
                        # (1 unchanged attribute hidden)
                    },
                  ~ {
                      ~ Action   = [
                          ~ "ecr:CreateRepository" -> "rds:CreateDBInstance",
                          ~ "ecr:DeleteRepository" -> "rds:DeleteDBInstance",
                          ~ "ecr:GetLifecyclePolicy" -> "rds:ModifyDBInstance",
                          ~ "ecr:PutLifecyclePolicy" -> "rds:CreateDBSubnetGroup",
                          ~ "ecr:DeleteLifecyclePolicy" -> "rds:DeleteDBSubnetGroup",
                          ~ "ecr:GetRepositoryPolicy" -> "rds:CreateDBParameterGroup",
                          ~ "ecr:SetRepositoryPolicy" -> "rds:DeleteDBParameterGroup",
                          ~ "ecr:DeleteRepositoryPolicy" -> "rds:ModifyDBParameterGroup",
                          ~ "ecr:TagResource" -> "rds:AddTagsToResource",
                          ~ "ecr:UntagResource" -> "rds:RemoveTagsFromResource",
                        ]
                      ~ Resource = "arn:aws:ecr:ap-northeast-2:646886795421:repository/*" -> "*"
                      ~ Sid      = "ManageECR" -> "ManageRDS"
                        # (1 unchanged attribute hidden)
                    },
                  ~ {
                      ~ Action   = [
                          - "rds:CreateDBInstance",
                          - "rds:DeleteDBInstance",
                          - "rds:ModifyDBInstance",
                          - "rds:CreateDBSubnetGroup",
                          - "rds:DeleteDBSubnetGroup",
                          - "rds:CreateDBParameterGroup",
                          - "rds:DeleteDBParameterGroup",
                          - "rds:ModifyDBParameterGroup",
                          - "rds:AddTagsToResource",
                          - "rds:RemoveTagsFromResource",
                          + "ec2:CreateVpc",
                          + "ec2:DeleteVpc",
                          + "ec2:ModifyVpcAttribute",
                          + "ec2:CreateSubnet",
                          + "ec2:DeleteSubnet",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeSubnets",
                        ]
                      ~ Sid      = "ManageRDS" -> "ManageVPC"
                        # (2 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Action   = [
                          - "ec2:CreateVpc",
                          - "ec2:DeleteVpc",
                          - "ec2:ModifyVpcAttribute",
                          - "ec2:CreateSubnet",
                          - "ec2:DeleteSubnet",
                          - "ec2:DescribeVpcs",
                          - "ec2:DescribeSubnets",
                          + "route53:ChangeResourceRecordSets",
                          + "route53:GetChange",
                          + "route53:ListResourceRecordSets",
                        ]
                      ~ Resource = "*" -> [
                          + "arn:aws:route53:::hostedzone/*",
                          + "arn:aws:route53:::change/*",
                        ]
                      ~ Sid      = "ManageVPC" -> "ManageRoute53Records"
                        # (1 unchanged attribute hidden)
                    },
                  ~ {
                      ~ Action   = [
                          - "route53:ChangeResourceRecordSets",
                          - "route53:GetChange",
                          - "route53:ListResourceRecordSets",
                          + "events:DescribeRule",
                          + "events:ListRules",
                          + "events:ListTagsForResource",
                          + "events:ListTargetsByRule",
                          + "events:PutRule",
                          + "events:DeleteRule",
                          + "events:PutTargets",
                          + "events:RemoveTargets",
                        ]
                      ~ Resource = [
                          - "arn:aws:route53:::hostedzone/*",
                          - "arn:aws:route53:::change/*",
                        ] -> "*"
                      ~ Sid      = "ManageRoute53Records" -> "ManageEventBridgeRules"
                        # (1 unchanged attribute hidden)
                    },
                  ~ {
                      ~ Action   = [
                          - "events:DescribeRule",
                          - "events:ListRules",
                          - "events:ListTagsForResource",
                          - "events:ListTargetsByRule",
                          - "events:PutRule",
                          - "events:DeleteRule",
                          - "events:PutTargets",
                          - "events:RemoveTargets",
                          + "ssm:PutParameter",
                          + "ssm:AddTagsToResource",
                          + "ssm:GetParameter",
                          + "ssm:GetParameters",
                          + "ssm:GetParametersByPath",
                        ]
                      ~ Resource = "*" -> "arn:aws:ssm:ap-northeast-2:646886795421:parameter/crawlinghub/eventbridge/*"
                      ~ Sid      = "ManageEventBridgeRules" -> "ManageSSMParametersForEventBridge"
                        # (1 unchanged attribute hidden)
                    },
                  ~ {
                      ~ Action   = [
                          - "ssm:PutParameter",
                          - "ssm:AddTagsToResource",
                          - "ssm:GetParameter",
                          - "ssm:GetParameters",
                          - "ssm:GetParametersByPath",
                          + "application-autoscaling:DescribeScalableTargets",
                          + "application-autoscaling:DescribeScalingPolicies",
                          + "application-autoscaling:ListTagsForResource",
                          + "application-autoscaling:RegisterScalableTarget",
                          + "application-autoscaling:DeregisterScalableTarget",
                          + "application-autoscaling:PutScalingPolicy",
                          + "application-autoscaling:DeleteScalingPolicy",
                        ]
                      ~ Resource = "arn:aws:ssm:ap-northeast-2:646886795421:parameter/crawlinghub/eventbridge/*" -> "*"
                      ~ Sid      = "ManageSSMParametersForEventBridge" -> "ManageApplicationAutoScaling"
                        # (1 unchanged attribute hidden)
                    },
                  ~ {
                      ~ Action   = [
                          - "application-autoscaling:DescribeScalableTargets",
                          - "application-autoscaling:DescribeScalingPolicies",
                          - "application-autoscaling:ListTagsForResource",
                          - "application-autoscaling:RegisterScalableTarget",
                          - "application-autoscaling:DeregisterScalableTarget",
                          - "application-autoscaling:PutScalingPolicy",
                          - "application-autoscaling:DeleteScalingPolicy",
                          + "servicediscovery:GetService",
                          + "servicediscovery:GetNamespace",
                          + "servicediscovery:ListServices",
                          + "servicediscovery:ListNamespaces",
                          + "servicediscovery:CreateService",
                          + "servicediscovery:UpdateService",
                          + "servicediscovery:DeleteService",
                          + "servicediscovery:RegisterInstance",
                          + "servicediscovery:DeregisterInstance",
                          + "servicediscovery:GetInstance",
                          + "servicediscovery:ListInstances",
                          + "servicediscovery:TagResource",
                          + "servicediscovery:UntagResource",
                          + "servicediscovery:ListTagsForResource",
                        ]
                      ~ Sid      = "ManageApplicationAutoScaling" -> "ServiceDiscoveryAccess"
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "iam:PassRole",
                            "iam:PutRolePolicy",
                            "iam:DeleteRolePolicy",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:iam::646886795421:role/crawlinghub-*-task-role-prod",
                            "arn:aws:iam::646886795421:role/crawlinghub-*-execution-role-prod",
                        ]
                        Sid      = "ManageCrawlingHubRoles"
                    },
                    # (1 unchanged element hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.atlantis_ecr.aws_ecr_repository.this must be replaced
-/+ resource "aws_ecr_repository" "this" {
      ~ arn                  = "arn:aws:ecr:ap-northeast-2:646886795421:repository/atlantis" -> (known after apply)
      ~ id                   = "atlantis" -> (known after apply)
        name                 = "atlantis"
      ~ registry_id          = "646886795421" -> (known after apply)
      ~ repository_url       = "646886795421.dkr.ecr.ap-northeast-2.amazonaws.com/atlantis" -> (known after apply)
        tags                 = {
            "Component"   = "container-registry"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "Docker images for Atlantis Terraform automation server"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "ecr-atlantis"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
        }
        # (2 unchanged attributes hidden)

      ~ encryption_configuration {
          ~ encryption_type = "KMS" -> "AES256" # forces replacement
          ~ kms_key         = "arn:aws:kms:ap-northeast-2:646886795421:key/fb74c860-dfb9-498f-9937-976a098b103c" -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.atlantis_ecr.aws_ssm_parameter.repository-url[0] will be updated in-place
~ resource "aws_ssm_parameter" "repository-url" {
        id              = "/shared/ecr/atlantis-repository-url"
      + insecure_value  = (known after apply)
        name            = "/shared/ecr/atlantis-repository-url"
        tags            = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "Docker images for Atlantis Terraform automation server"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
        }
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.

Changes to Outputs:
~ atlantis_ecr_repository_arn          = "arn:aws:ecr:ap-northeast-2:646886795421:repository/atlantis" -> (known after apply)
~ atlantis_ecr_repository_url          = "646886795421.dkr.ecr.ap-northeast-2.amazonaws.com/atlantis" -> (known after apply)
~ atlantis_task_definition_arn         = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/atlantis-prod:11" -> (known after apply)
~ atlantis_task_definition_revision    = 11 -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p atlantis-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FInfrastructure%252Fterraform%252Fenvironments%252Fprod%252Fatlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p atlantis-prod
  ```
Plan: 2 to add, 3 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```